In [102]:
import pandas as pd

# for formatting values
pd.options.display.float_format= '{:,.2f}'.format

# loading csv file
df = pd.read_csv("salaries-by-college-major.csv")

In [103]:
df.head()
(rows, cols) = df.shape
columns = df.columns
df.isna()
df.tail()
cleaned_df = df.dropna()
cleaned_df.tail()

print(f"Columns = {columns}")

Columns = Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [104]:
# Max item
# max(cleaned_df['Starting Median Salary'])
cleaned_df['Starting Median Salary'].max()
cleaned_df['Starting Median Salary'].idxmax()

# getting by id
cleaned_df['Starting Median Salary'].loc[43]
cleaned_df['Starting Median Salary'][43]

74300.0

In [105]:
cleaned_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                         74,300.00
Mid-Career Median Salary                       91,700.00
Mid-Career 10th Percentile Salary              66,400.00
Mid-Career 90th Percentile Salary             124,000.00
Group                                               STEM
Name: 43, dtype: object

In [106]:
print(cleaned_df['Mid-Career Median Salary'].max())
max_mid_career_salary_index = cleaned_df['Mid-Career Median Salary'].idxmax()
print(f"Index for the max mid career salary: {max_mid_career_salary_index}")
cleaned_df['Undergraduate Major'][max_mid_career_salary_index]

107000.0
Index for the max mid career salary: 8

'Chemical Engineering'

In [107]:
lowest_starting_salary = cleaned_df['Starting Median Salary'].min()
print(lowest_starting_salary)
lowest_starting_salary_index = cleaned_df['Starting Median Salary'].idxmin()
cleaned_df['Undergraduate Major'][lowest_starting_salary_index]

34000.0

'Spanish'

In [108]:
lowest_mid_career_salary_index = cleaned_df['Mid-Career Median Salary'].idxmin()
cleaned_df.loc[lowest_mid_career_salary_index]

Undergraduate Major                  Education
Starting Median Salary               34,900.00
Mid-Career Median Salary             52,000.00
Mid-Career 10th Percentile Salary    29,300.00
Mid-Career 90th Percentile Salary   102,000.00
Group                                     HASS
Name: 18, dtype: object

In [111]:
# To calculate the difference between the Two different columns
cleaned_df['Mid-Career 90th Percentile Salary'] - cleaned_df['Mid-Career 10th Percentile Salary']
# OR
spread_col = cleaned_df['Mid-Career 90th Percentile Salary'].subtract(cleaned_df['Mid-Career 10th Percentile Salary'])
# To add the result back to the dataframe
cleaned_df.insert(1, 'Spread', spread_col)  # Can't be executed twice in a single instance
cleaned_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"109,800.00","46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"96,700.00","57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"113,700.00","42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"104,200.00","36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"85,400.00","41,600.00","76,800.00","50,600.00","136,000.00",Business

In [112]:
# sorting
low_risk = cleaned_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major    Spread
40                     Nursing 50,700.00
43         Physician Assistant 57,600.00
41                   Nutrition 65,300.00
49                     Spanish 65,400.00
27  Health Care Administration 66,400.00

In [113]:
high_potential = cleaned_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)
high_potential[['Undergraduate Major','Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                         210,000.00
22               Finance                         195,000.00
8   Chemical Engineering                         194,000.00
37                  Math                         183,000.00
44               Physics                         178,000.00

In [114]:
great_spread = cleaned_df.sort_values('Spread', ascending=False)
great_spread[['Undergraduate Major','Spread']].head()

   Undergraduate Major     Spread
17           Economics 159,400.00
22             Finance 147,800.00
37                Math 137,800.00
36           Marketing 132,900.00
42          Philosophy 132,500.00

In [116]:
groups = cleaned_df.groupby('Group')
groups_items = groups.count()
groups_mean = groups.mean(numeric_only=True)
print(groups_mean)

             Spread  Starting Median Salary  Mid-Career Median Salary  \
Group
Business 103,958.33               44,633.33                 75,083.33
HASS      95,218.18               37,186.36                 62,968.18
STEM     101,600.00               53,862.50                 90,812.50

          Mid-Career 10th Percentile Salary  Mid-Career 90th Percentile Salary
Group
Business                          43,566.67                         147,525.00
HASS                              34,145.45                         129,363.64
STEM                              56,025.00                         157,625.00

***Today's Learning Points:***

1. Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

2. Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.

3. You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

4. You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

5. The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

6. You can sort the DataFrame with .sort_values() and add new columns with .insert()

7. To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method